In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark','artichoke',np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [9]:
string_data[0]= 1

In [10]:
string_data

0            1
1    artichoke
2          NaN
3      avocado
dtype: object

In [11]:
string_data.fillna

<bound method Series.fillna of 0            1
1    artichoke
2          NaN
3      avocado
dtype: object>

In [12]:
from numpy import nan as NA

In [13]:
data = pd.Series([1,NA,3.5,NA,7])

In [14]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
cleaned = data.dropna(how='all')

In [21]:
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[1] = NA

In [23]:
data

     0   1    2
0  1.0 NaN  3.0
1  1.0 NaN  NaN
2  NaN NaN  NaN
3  NaN NaN  3.0

In [24]:
data.dropna(axis=1,how='all')

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [25]:
data2 = pd.DataFrame(np.random.randn(7,3))

In [26]:
data2.iloc[:4,1] =NA

In [27]:
data2.iloc[:2,2] = NA

In [28]:
data2

          0         1         2
0  0.297835       NaN       NaN
1  0.062928       NaN       NaN
2 -0.071690       NaN -0.008517
3 -0.136564       NaN  1.038473
4  0.437682 -0.880113 -1.354931
5  0.378318  0.183603 -0.426988
6 -0.338200 -0.067899 -0.684361

In [29]:
data2.dropna()

          0         1         2
4  0.437682 -0.880113 -1.354931
5  0.378318  0.183603 -0.426988
6 -0.338200 -0.067899 -0.684361

In [30]:
data2.dropna(thresh=2)

          0         1         2
2 -0.071690       NaN -0.008517
3 -0.136564       NaN  1.038473
4  0.437682 -0.880113 -1.354931
5  0.378318  0.183603 -0.426988
6 -0.338200 -0.067899 -0.684361

In [31]:
data2.fillna(0)

          0         1         2
0  0.297835  0.000000  0.000000
1  0.062928  0.000000  0.000000
2 -0.071690  0.000000 -0.008517
3 -0.136564  0.000000  1.038473
4  0.437682 -0.880113 -1.354931
5  0.378318  0.183603 -0.426988
6 -0.338200 -0.067899 -0.684361

In [32]:
data2.fillna({1:0.5,2:0})

          0         1         2
0  0.297835  0.500000  0.000000
1  0.062928  0.500000  0.000000
2 -0.071690  0.500000 -0.008517
3 -0.136564  0.500000  1.038473
4  0.437682 -0.880113 -1.354931
5  0.378318  0.183603 -0.426988
6 -0.338200 -0.067899 -0.684361

In [33]:
_ = data2.fillna(0, inplace = True)

In [34]:
data2

          0         1         2
0  0.297835  0.000000  0.000000
1  0.062928  0.000000  0.000000
2 -0.071690  0.000000 -0.008517
3 -0.136564  0.000000  1.038473
4  0.437682 -0.880113 -1.354931
5  0.378318  0.183603 -0.426988
6 -0.338200 -0.067899 -0.684361

In [35]:
data = pd.DataFrame({'k1': ['one','two'] *3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
data['v1'] = range(7)

In [39]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [40]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [44]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data = pd.DataFrame({"food": ['bacon', 'pulled pork','bacon','Pastrami',
                             'corned beef','Bacon','pastrami','honey ham','nova lox'],
                     'ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_type = {'bacon':'pig',
            'pulled pork': 'pig',
            'pastrami': 'cow',
            'corned beef' : 'cow',
            "honey ham": "pig",
            'nova lox': 'salmon'}

In [47]:
lowercased = data['food'].str.lower()

In [48]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal'] = lowercased.map(meat_type)

In [53]:
data.drop(data.columns [[2]], axis = 1)

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
data['food'].map(lambda x: meat_type[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [55]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [56]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
data.replace([-999,-1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data.replace({-999: np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])

In [61]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [85]:
transform = lambda x: x[:4].upper()

In [86]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [87]:
data.index = data.index.map(transform)

In [88]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [89]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [99]:
data.rename(index={"OHIO":"INDIANA"}, inplace = True)

In [100]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [101]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

In [109]:
bins = [18,25,35,60,100]

In [112]:
#Allows you to group together different ages
cats = pd.cut(ages, bins)

In [113]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [117]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [118]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [120]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [124]:
pd.cut(ages, [18,26,36,61,100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [132]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [133]:
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [139]:
data = np.random.rand(20)

In [140]:
data

array([0.98589765, 0.89008033, 0.96157831, 0.88146318, 0.90028193,
       0.75766242, 0.21306533, 0.80909273, 0.40782886, 0.43597591,
       0.88671191, 0.74763928, 0.55545653, 0.01108213, 0.54088788,
       0.67051194, 0.91142548, 0.44512756, 0.14214657, 0.04879382])

In [141]:
pd.cut(data, 4, precision=2)

[(0.74, 0.99], (0.74, 0.99], (0.74, 0.99], (0.74, 0.99], (0.74, 0.99], ..., (0.5, 0.74], (0.74, 0.99], (0.25, 0.5], (0.01, 0.25], (0.01, 0.25]]
Length: 20
Categories (4, interval[float64]): [(0.01, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.99]]

In [143]:
data = np.random.randn(1000)

In [144]:
cats = pd.qcut(data,4)

In [145]:
cats

[(-3.295, -0.678], (-0.678, 0.0102], (0.0102, 0.695], (-3.295, -0.678], (-3.295, -0.678], ..., (-3.295, -0.678], (0.695, 3.061], (0.695, 3.061], (-0.678, 0.0102], (0.695, 3.061]]
Length: 1000
Categories (4, interval[float64]): [(-3.295, -0.678] < (-0.678, 0.0102] < (0.0102, 0.695] < (0.695, 3.061]]

In [146]:
pd.value_counts(cats)

(0.695, 3.061]      250
(0.0102, 0.695]     250
(-0.678, 0.0102]    250
(-3.295, -0.678]    250
dtype: int64

In [147]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.293, 0.0102], (-1.293, 0.0102], (0.0102, 1.326], (-3.295, -1.293], (-1.293, 0.0102], ..., (-3.295, -1.293], (0.0102, 1.326], (1.326, 3.061], (-1.293, 0.0102], (0.0102, 1.326]]
Length: 1000
Categories (4, interval[float64]): [(-3.295, -1.293] < (-1.293, 0.0102] < (0.0102, 1.326] < (1.326, 3.061]]

In [152]:
data = pd.DataFrame(np.random.randn(1000,4))

In [153]:
data

            0         1         2         3
0   -0.223014  0.195266 -1.798988 -0.632589
1    0.397336  2.052029 -1.004209 -0.975927
2   -0.199624 -1.229938  1.230260  0.902626
3    0.238987  0.716143 -0.759177 -0.861841
4   -0.520377  0.700577 -0.510171 -1.720325
5   -1.097532  0.230556  0.698773 -0.127248
6    0.933068  1.827471 -1.014013 -0.961045
7   -0.235254  1.002336  0.886314 -0.160603
8    0.731918 -0.892205 -0.596709 -1.237109
9   -2.013380 -0.088835  0.615417 -0.468820
10   1.065617  0.180731  0.071442 -0.458211
11  -0.770415 -1.189281  0.779185 -1.097635
12  -0.058038 -2.830760 -0.840292 -1.203061
13   2.334999  0.849904  1.604671 -0.406341
14  -0.283705 -0.033792  0.892502 -1.853009
15  -0.784577 -1.301564  1.707405 -0.056585
16  -0.010411 -1.805431  0.477319 -0.181985
17   0.448063 -0.120662  0.555314  0.035852
18  -0.081706 -0.066492  1.886427 -1.044320
19   0.642456  1.081642 -1.371587  1.307400
20  -0.271922 -0.454983 -0.455234 -0.194319
21   0.329101  0.493107 -0.316255 -0.574205
22  -0.780611 -0.899766  1.055051  1.143023
23  -1.638887  0.369082  1.197298  0.016500
24  -0.224293 -0.665592  0.780129  1.693826
25  -1.019356 -0.230943  0.692678  0.759086
26   1.089999 -1.029682 -0.722790 -0.317751
27  -0.648054  0.358071  1.814319 -0.075758
28  -1.099769  1.560135  0.540986 -0.534155
29   1.049936 -0.491073  0.103210  0.635837
..        ...       ...       ...       ...
970 -0.605610 -1.247759  0.572915  0.763176
971 -0.337687  0.953087 -0.285462 -0.056039
972 -0.287697  0.877463  0.016198  0.852124
973 -2.648342  0.247856  0.329075  0.998120
974  0.800189  0.678193  1.274936 -1.721640
975 -2.609072  0.425462  0.418417  1.658297
976  0.427183 -1.173811  1.274625 -0.587438
977 -0.535776 -0.188687  0.196306 -0.682004
978 -0.678493  0.576411 -1.470554  0.462672
979  0.035450 -1.004577 -0.307250  0.614807
980  0.702670 -0.704468 -2.237803 -0.978688
981 -0.147874  1.873214 -1.586367 -0.933327
982  1.809392 -1.056136  1.739219  0.076153
983 -1.373154  1.906881 -0.760356  0.126118
984  0.686115 -0.405587  1.342018  1.879571
985 -0.444923 -0.577109  0.307841 -0.440833
986  0.693919  1.225669  0.850712  0.510439
987 -1.212978  1.678598  0.076504  0.698102
988 -1.620669  0.527085  1.275243  0.601560
989 -0.140279 -0.989879 -0.739995 -1.312852
990  1.452247  0.869386  1.381434 -0.317793
991 -1.225270  0.341981 -0.688985 -0.623026
992 -1.251175  0.251810 -0.364883  0.389314
993  1.593592  2.136816  0.376078  0.324410
994 -0.150286  1.701942 -0.257856 -1.430473
995  2.074478 -0.581070 -0.682615 -0.903418
996  0.687049  0.086772 -1.501824  0.079809
997  0.362607 -0.056797  0.460564  1.176480
998 -0.046689  1.858572 -0.494325 -0.044564
999 -0.205444  0.460621 -0.105836 -0.122095

[1000 rows x 4 columns]

In [154]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021797     0.035713     0.048563    -0.054091
std       1.007351     1.028384     0.991289     0.985354
min      -3.043743    -3.407211    -2.764576    -2.982020
25%      -0.693662    -0.663193    -0.615138    -0.723974
50%      -0.003881     0.025352     0.037661    -0.064064
75%       0.677875     0.694484     0.748399     0.615468
max       3.555880     3.399681     3.684951     3.685743

In [155]:
col = data[2]

In [157]:
col[np.abs(col) > 3]

345    3.153103
679    3.684951
Name: 2, dtype: float64

In [161]:
data[(np.absolute(data) >3).any(1)]

            0         1         2         3
68  -0.261387  3.189255  1.152025  0.929678
222 -1.352232  3.144912  0.502724  0.823023
262  0.975888  0.352981 -1.180882  3.154302
318  0.984422  0.563828 -1.346876  3.685743
345  0.741032 -1.662768  3.153103 -2.165301
400 -3.043743 -0.645715 -0.412486  0.613946
582  1.217308  3.026364  0.386979 -0.739362
625  2.317182  3.010410 -0.604875  0.043992
679 -0.908301  0.444104  3.684951  0.765579
685 -0.736411 -3.407211  0.401581 -0.101381
691 -0.083282 -0.355959 -0.991514  3.059768
735  3.555880 -0.038793  0.675379  1.601193
791 -2.193468  0.981760 -0.327123  3.046500
872 -2.205108  3.399681 -0.711472  1.670491
912  3.002736 -0.415385 -0.109038 -0.372856
928  3.156331 -0.119314  1.297036  0.043737

In [164]:
data[np.abs(data)>3] = np.sign(data)*3

In [165]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021126     0.035350     0.047725    -0.055037
std       1.004934     1.024764     0.988539     0.982159
min      -3.000000    -3.000000    -2.764576    -2.982020
25%      -0.693662    -0.663193    -0.615138    -0.723974
50%      -0.003881     0.025352     0.037661    -0.064064
75%       0.677875     0.694484     0.748399     0.615468
max       3.000000     3.000000     3.000000     3.000000

In [168]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0  1.0  1.0
3  1.0  1.0 -1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

In [170]:
df =  pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [186]:
sampler = np.random.permutation(5)

In [187]:
sampler

array([0, 1, 3, 4, 2])

In [188]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [189]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11

In [192]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [193]:
choices = pd.Series([5,7,-1,6,4])

In [198]:
draws = choices.sample(n=10, replace = True)

In [199]:
draws

3    6
1    7
2   -1
4    4
2   -1
4    4
2   -1
0    5
1    7
2   -1
dtype: int64

In [202]:
df = pd.DataFrame({'key': ['b','b','a','c','a','b'],
                  'data1': range(6)})

In [203]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [207]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [211]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [213]:
df_with_dummy = df[['data1']].join(dummies)

In [214]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [215]:
mnames = ['movieid','title','genres']

In [218]:
val = 'a,b,  suido'

In [219]:
val

'a,b,  suido'

In [220]:
val.split(',')

['a', 'b', '  suido']

In [223]:
pieces = [x.strip() for x in val.split(',')]

In [224]:
pieces

['a', 'b', 'suido']

In [227]:
first,second,third = pieces

In [228]:
first +'::' +second + "::" + third

'a::b::suido'

In [229]:
'::'.join(pieces)

'a::b::suido'

In [230]:
'suido' in val

True

In [232]:
val.index(',')

1

In [233]:
val.find(':')

-1

In [234]:
val.index(':')

ValueError: substring not found

In [235]:
val.count(',')

2

In [236]:
val.count(':')

0

In [245]:
val.replace(',','::')

'a::b::  suido'

In [247]:
val.count('::')

0

In [249]:
val.replace(',','')

'ab  suido'

In [250]:
import re

In [253]:
text = 'foo    b\t  baz  \tqux'
text

'foo    b\t  baz  \tqux'

In [254]:
re.split('\s+', text)

['foo', 'b', 'baz', 'qux']

In [256]:
regex = re.compile('\s+')

In [258]:
regex.split(text)

['foo', 'b', 'baz', 'qux']

In [259]:
regex.findall(text)

['    ', '\t  ', '  \t']

In [260]:
text = """ Dave dave@google.com
Steve steve@gmail.com
ROb rob@gmail.com
Ryan ryan@yahoo.com
"""

In [262]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [263]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [266]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [267]:
m = regex.search(text)

In [268]:
m

In [269]:
text[m.start():m.end()]

'dave@google.com'

In [273]:
print(regex.match(text))

None

In [278]:
## This returns a new string with occurences of the patterns replaces by a new string
print(regex.sub('REDACTED',text))

 Dave REDACTED
Steve REDACTED
ROb REDACTED
Ryan REDACTED

In [279]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [280]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [287]:
m = regex.match('wesm@bright.net')

In [288]:
m.groups()

('wesm', 'bright', 'net')

In [289]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [291]:
print(regex.sub('REDACTED',text))

 Dave REDACTED
Steve REDACTED
ROb REDACTED
Ryan REDACTED

In [292]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

 Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
ROb Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [332]:
data = {'Dave' :'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail2.com','Wes':np.nan}

In [333]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail2.com',
 'Wes': nan}

In [334]:
data = pd.Series(data)

In [335]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob       rob@gmail2.com
Wes                  NaN
dtype: object

In [336]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [337]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [338]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [339]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob       [(rob, gmail2, com)]
Wes                        NaN
dtype: object

In [340]:
matches = data.str.findall(pattern, flags = re.IGNORECASE).str[0]

In [341]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob       (rob, gmail2, com)
Wes                      NaN
dtype: object

In [342]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob      gmail2
Wes         NaN
dtype: object

In [343]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [344]:
data.str.extract(pattern, flags = re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob  gmail2  com
Wes      NaN     NaN  NaN